Управление_торговлей.ПБТ/src/Documents/АктОтбора/АктОтбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктОтбора</name>
  <registerRecords>AccumulationRegister.ОтборОбразцов</registerRecords>
  <registerRecords>InformationRegister.СтатусыОбразцов</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйПровел</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ППК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВИСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Образцы</name>
    <attributes>
      <name>ДатаИзготовления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПродукта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗамеса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаОбОтбореАрбитражногоОбразца</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоступленияНаСклад</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРеализации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрОбразцы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.МаршрутныйЛист</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧ_ВидыИсследований</name>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>Лаборатория</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаОбразца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиТЧОбразцы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Образец</name>
      <type>
        <types>CatalogRef.ЛабораторныйОбразец</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.ПериодичностьЛаб</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выбрать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиТЧИсследований</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИныеПоказатели</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Линии</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыЗамеса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗамеса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопМаркировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗакладки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСмешивания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФакт</name>
    <comment>Дата фактического производства</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезПотерь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Рецепт</name>
    <type>
      <types>CatalogRef.вт_ВариантыПроизводстваПоТехКартам</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаНоменклатуры</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСырья</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рецептурщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыМаршрутныхЛистов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиТЧПлан</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыИсследований</name>
    <attributes>
      <name>ВидИсследований</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>Лаборатория</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>МассаОбразца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.ПериодичностьЛаб</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыПлан</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество100</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиПлан</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Разница</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Допуск</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Documents/АктОтбора/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТЧ_ОбразцыПриАктивизацииСтроки(Элемент)
	
	Данные = Элементы.ТЧ_Образцы.ТекущиеДанные;
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	//устанавливаем идентификатор если он пустой
	Если НЕ ЗначениеЗаполнено(Данные.ИдентификаторСтрОбразцы) Тогда 
		Данные.ИдентификаторСтрОбразцы = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	//устанавливаем отбор в подчиненных табличных частях
	Элементы.ТЧ_ВидыИсследований.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиТЧОбразцы", Данные.ИдентификаторСтрОбразцы);
	
	ДанныеВИ = Элементы.ТЧ_ВидыИсследований.ТекущиеДанные;
	Если НЕ ДанныеВИ = Неопределено Тогда
		Элементы.Показатели.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиТЧИсследований", ДанныеВИ.ИдентификаторСтроки);
	КонецЕсли;  
		
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ОбразцыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	//Данные = Элементы.ТЧ_Образцы.ТекущиеДанные;
	//Если НоваяСтрока Тогда 
	//	Данные.ИдентификаторСтрОбразцы = Новый УникальныйИдентификатор;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ВидыИсследованийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	//Данные = Элементы.ТЧ_Образцы.ТекущиеДанные;
	//ТекДанные = Элементы.ТЧ_ВидыИсследований.ТекущиеДанные;
	//Если НоваяСтрока Тогда
	//	ТекДанные.ИдентификаторСтрокиТЧОбразцы = Данные.ИдентификаторСтрОбразцы;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ОбразцыПередУдалением(Элемент, Отказ)
	Данные = Элементы.ТЧ_Образцы.ТекущиеДанные;
	Отбор = Новый Структура("ИдентификаторСтрокиТЧОбразцы",Данные.ИдентификаторСтрОбразцы);
	Масс = Объект.ТЧ_ВидыИсследований.НайтиСтроки(Отбор);
	Для каждого Строка из Масс Цикл
		Объект.ТЧ_ВидыИсследований.Удалить(Строка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ВидыИсследованийПриАктивизацииСтроки(Элемент)
	
	ДанныеВИ = Элементы.ТЧ_ВидыИсследований.ТекущиеДанные;
	Если ДанныеВИ = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	//устанавливаем идентификатор если он пустой
	Если НЕ ЗначениеЗаполнено(ДанныеВИ.ИдентификаторСтроки) Тогда 
		ДанныеВИ.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		
		Данные = Элементы.ТЧ_Образцы.ТекущиеДанные;
		ДанныеВИ.ИдентификаторСтрокиТЧОбразцы = Данные.ИдентификаторСтрОбразцы;
	КонецЕсли;
	
	//устанавливаем отбор в подчиненных табличных частях
	Элементы.Показатели.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиТЧИсследований", ДанныеВИ.ИдентификаторСтроки);

КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ВидыИсследованийПередУдалением(Элемент, Отказ)
	
	ДанныеВИ = Элементы.ТЧ_Образцы.ТекущиеДанные;
	Отбор = Новый Структура("ИдентификаторСтрокиТЧИсследований",ДанныеВИ.ИдентификаторСтроки);
	Масс = Объект.Показатели.НайтиСтроки(Отбор);
	Для каждого Строка из Масс Цикл
		Объект.Показатели.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПриАктивизацииСтроки(Элемент)
	
	ДанныеВИ = Элементы.ТЧ_ВидыИсследований.ТекущиеДанные;
	Если ДанныеВИ = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ДанныеПок = Элементы.Показатели.ТекущиеДанные;
	Если ДанныеПок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//устанавливаем идентификатор ВИ если он пустой
	Если НЕ ЗначениеЗаполнено(ДанныеПок.ИдентификаторСтрокиТЧИсследований) Тогда 
		ДанныеПок.ИдентификаторСтрокиТЧИсследований = ДанныеВИ.ИдентификаторСтроки;
		ДанныеПок.ВидИсследования = ДанныеВИ.ВидИсследования;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Первоначальное заполнение объекта.
	Если Параметры.Ключ.Пустая() Тогда
		
		//Объект.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", ""); 
		Объект.ДатаСоздания = ТекущаяДатаСеанса();
		
		Объект.Пользователь = Пользователи.ТекущийПользователь(); 
		Для каждого СтрВИ Из Объект.ТЧ_ВидыИсследований Цикл
		    СтрВИ.Образец = "";
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ОбразцыПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//СерияНачалоВыбораНаСервере(Элемент);
	НачалоВыбораСерии();
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораСерии()

	ТекСтрока = Элементы.ТЧ_Образцы.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура("Номенклатура, Серия, Склад, ИдентификаторСтроки", Объект.Номенклатура, ТекСтрока.Серия, ,ТекСтрока.ПолучитьИдентификатор());
	ОповещениеОЗакрытие = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораСерии", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура("Уникальность, Окно, НавигационнаяСсылка, Владелец", Ложь);
	
	ОткрытьФорму("Документ.МаршрутныйЛист.Форма.ФормаВыбораСерии", ПараметрыФормы,
	ПараметрыОткрытияФормы.Владелец, ПараметрыОткрытияФормы.Уникальность,
	ПараметрыОткрытияФормы.Окно, ПараметрыОткрытияФормы.НавигационнаяСсылка, ОповещениеОЗакрытие);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗакрытияФормыВыбораСерии(СтрукПараметров, ДополнительныеПараметры)
	
	Если НЕ СтрукПараметров = неопределено Тогда
		Если СтрукПараметров.Свойство("ИдентификаторСтроки") Тогда
			ТекущаяСтрока = Объект.ТЧ_Образцы.НайтиПоИдентификатору(СтрукПараметров.ИдентификаторСтроки);
			Если СтрукПараметров.Свойство("Серия") Тогда
				ТекущаяСтрока.Серия = СтрукПараметров.Серия;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если Не ЗначениеЗаполнено(Объект.ПервыйПровел) Тогда
			ЗаполнитьПервогоПровел();
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПервогоПровел()
	Объект.ПервыйПровел = Пользователи.ТекущийПользователь();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ОбразцыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры
